1c_um/src/InformationRegisters/ум_ПакетыДанных/ум_ПакетыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ум_ПакетыДанных</name>
  <resources>
    <name>ВременнаяМеткаСоздания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КлючАналитикиПакетаДанных</name>
    <type>
      <types>CatalogRef.ум_КлючиАналитикиПакетовДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработкиПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующейОбработкиПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьОбработки</name>
    <comment>Длительность обработки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючРабочегоПотока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПакетПрипаркован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторПакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c_um/src/InformationRegisters/ум_ПакетыДанныхДанные/ум_ПакетыДанныхДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ум_ПакетыДанныхДанные</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторПакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c_um/src/Enums/ум_СостоянияПакетаДанных/ум_СостоянияПакетаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ум_СостоянияПакетаДанных</name>
  <enumValues>
    <name>ВОбработке</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

1c_um/src/InformationRegisters/ум_ПакетыДанных/Forms/ФормаСписка/Module.bsl
//////////////////////////////////////////////////////////////////////////
// Обработчики событий формы
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСтатистикуПакетов_Сервер();
	
	УИДИдентификаторПакетаВидСравнения = "Равно";
	УИДИдентификаторПакетаИспользование = Ложь;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ум_ПакетыДанных) Тогда
		
		Элементы.ФормаОбработатьПакеты.Доступность = Ложь;
		Элементы.ИзменитьВыделенныеПакеты.Доступность = Ложь;
		Элементы.СписокПакетовГрупповоеИзменениеПакетов.Доступность = Ложь;
		Элементы.ИзменитьВыделенныеПакеты.Доступность = Ложь;
		
	КонецЕсли;
	
	Если ТекущийВариантИнтерфейсаКлиентскогоПриложения() = ВариантИнтерфейсаКлиентскогоПриложения.Такси Тогда
		УстановитьУсловноеОформление();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью();
КонецПроцедуры

#КонецОбласти

//////////////////////////////////////////////////////////////////////////
// Обработчики команд формы
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработатьПакетыКоманда(Команда)
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если ум_ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, "8.5.1.0") > 0 Тогда
		МассивВыделенныхСтрок = Элементы.СписокПакетов.ПолучитьСтрокиДляОбработки();
	Иначе
		МассивВыделенныхСтрок = Элементы.СписокПакетов.ВыделенныеСтроки; 
	КонецЕсли;
	
	Если МассивВыделенныхСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = "Обработать " + Строка(МассивВыделенныхСтрок.Количество()) + " пакета(-ов)?";
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьПакетыКоманда_Продолжение",  ЭтаФорма, МассивВыделенныхСтрок);	   		
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена, 0, КодВозвратаДиалога.Отмена, "Обработка пакетов");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтатистикуПакетовСОшибками(Команда)
	
	СпособОбработки = ПолучитьУстановленныйОтборПоСпособуОбработкиПакета();
	
	ПараметрыОткрытия = Новый Структура;  
	
	Если ЗначениеЗаполнено(СпособОбработки)  Тогда
		ПараметрыОткрытия.Вставить("СпособОбработкиПакета",СпособОбработки); 		
	КонецЕсли; 
		
	ОписаниеОповещенияЗакрытия = Новый ОписаниеОповещения("ПослеЗакрытияФормы_ФормаПросмотраСтатистикиОшибок" ,ЭтаФорма);
	ОткрытьФорму("РегистрСведений.ум_ПакетыДанных.Форма.ФормаПросмотраСтатистикиОшибок" ,ПараметрыОткрытия, ЭтаФорма,,,,ОписаниеОповещенияЗакрытия,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДанныеПакета(Команда)
	
	ТекущиеДанные = Элементы.СписокПакетов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресХранилищаДанных = ПолучитьДанныеПакетаВХранилище(ТекущиеДанные.ИдентификаторПакета);
	ПараметрыФормы = Новый Структура("АдресХранилищаДанных", АдресХранилищаДанных);
	ТекстЗаголовка = СтрШаблон("Данные пакета %1", Строка(ТекущиеДанные.ИдентификаторПакета));
	ПараметрыФормы.Вставить("Заголовок", ТекстЗаголовка);
	ОткрытьФорму("ОбщаяФорма.ум_ФормаПросмотраДанных",
				 ПараметрыФормы,
				 ЭтаФорма,
				 УникальныйИдентификатор,
				 ,
				 ,
				 ,
				 РежимБлокировкиПриОткрытииОкнаФормы.НеБлокировать
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВыделенныеПакеты(Команда)
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если ум_ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, "8.5.1.0") > 0 Тогда
		МассивВыделенныхСтрок = Элементы.СписокПакетов.ПолучитьСтрокиДляОбработки();
	Иначе
		МассивВыделенныхСтрок = Элементы.СписокПакетов.ВыделенныеСтроки; 
	КонецЕсли;
	
	Если МассивВыделенныхСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.ум_ПакетыДанных.Форма.ВыполнениеДействийСПакетами", Новый Структура("МассивВыделенныхСтрок", МассивВыделенныхСтрок), ЭтаФорма, ,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура МногопоточноеИзменениеПакетов(Команда)
	
	ОткрытьФорму("Обработка.ум_ИзменениеПакетовДанных.Форма.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатистику(Команда)
	
	ОбновитьСтатистикуПакетов_Сервер();
	
КонецПроцедуры

//-
&НаКлиенте
Процедура НайтиПоДанным(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	
	Описание = Новый ОписаниеОповещения("ПослеЗакрытияФормы",ЭтаФорма);
	ОткрытьФорму("РегистрСведений.ум_ПакетыДанных.Форма.ВыборОтборовПоискаПоДанным",ПараметрыОткрытия,ЭтаФорма,,,,Описание,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

//////////////////////////////////////////////////////////////////////////
// Обработчики событий элементов формы
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СтраницыФормыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ОбновитьСтатистикуПакетов_Сервер();

КонецПроцедуры

&НаКлиенте
Процедура СтатистикаПакетовОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;    	
	СсылкаДляОткрытия = Неопределено;
	СтатистикаПакетовОбработкаРасшифровки_НаСервере(Расшифровка, СсылкаДляОткрытия);
	
	Если ЗначениеЗаполнено(СсылкаДляОткрытия) Тогда
		ПоказатьЗначение(,СсылкаДляОткрытия);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УИДИдентификаторПакетаПриИзменении(Элемент)
	
	Если УИДИдентификаторПакетаВидСравнения = "Равно" Тогда
		текВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ИначеЕсли УИДИдентификаторПакетаВидСравнения = "НеРавно" Тогда
		текВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;    
	ИначеЕсли УИДИдентификаторПакетаВидСравнения = "ВСписке" Тогда
		текВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;    
	ИначеЕсли УИДИдентификаторПакетаВидСравнения = "НеВСписке" Тогда
		текВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;    
	Иначе
		ВызватьИсключение "Неожиданный псевдоним вида сравнения """+УИДИдентификаторПакетаВидСравнения+"""!";
		Возврат;
	КонецЕсли;   
	
	ЭтоСписок = текВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке ИЛИ
				текВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;

	Если Элемент.Имя = "УИДИдентификаторПакетаЗначение" Тогда
		УИДИдентификаторПакетаИспользование = Истина;
	ИначеЕсли Элемент.Имя = "УИДИдентификаторПакетаСписокЗначений" Тогда		
		УИДИдентификаторПакетаИспользование = Истина;		
	ИначеЕсли Элемент.Имя = "УИДИдентификаторПакетаВидСравнения" Тогда
		УИДИдентификаторПакетаИспользование = Истина; 
		Если ЭтоСписок И Не Элементы.УИДИдентификаторПакетаСписокЗначений.Видимость Тогда
			УИДИдентификаторПакетаСписокЗначений.Очистить();
			Если ЗначениеЗаполнено(УИДИдентификаторПакетаЗначение) Тогда
            	УИДИдентификаторПакетаСписокЗначений.Добавить(УИДИдентификаторПакетаЗначение);
			КонецЕсли;
		ИначеЕсли Не ЭтоСписок И Не Элементы.УИДИдентификаторПакетаЗначение.Видимость Тогда
			УИДИдентификаторПакетаЗначение = "";
			Если УИДИдентификаторПакетаСписокЗначений.Количество() Тогда
				УИДИдентификаторПакетаЗначение = УИДИдентификаторПакетаСписокЗначений[0];
			КонецЕСли;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьЭлементОтбораДинамическогоСписка(
		"ИдентификаторПакета",
		?(ЭтоСписок, УИДИдентификаторПакетаСписокЗначений, УИДИдентификаторПакетаЗначение),
		текВидСравнения,
		УИДИдентификаторПакетаИспользование
	);   
	
	УправлениеВидимостью(); 
	
КонецПроцедуры

&НаСервере
Процедура СписокПакетовПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки, ИспользуютсяСтандартныеНастройки)
	 
	// исключаем пересекающийся отбор с программным отбором на идентификатор пакета
	УдалитьНастройкуОтборПоИдентификаторуПакета(Элемент, Настройки, ИспользуютсяСтандартныеНастройки)  
	
КонецПроцедуры

#КонецОбласти

//////////////////////////////////////////////////////////////////////////
// Прочие процедуры и функции
#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОбработатьПакетыНаСервере(МассивВыделенныхСтрок)
	
	Для Каждого КлючСтроки из МассивВыделенныхСтрок Цикл
		
		ум_ПакетыДанных.ОбработатьПакетДанныхВСеансеПользователя(КлючСтроки.ИдентификаторПакета);
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьПакетыКоманда_Продолжение(Результат, МассивВыделенныхСтрок) Экспорт
	
	Если Результат <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьПакетыНаСервере(МассивВыделенныхСтрок);
	Элементы.СписокПакетов.Обновить();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьУстановленныйОтборПоСпособуОбработкиПакета()
	
	СпособОбработки = Справочники.ум_СпособыОбработкиПакетов.ПустаяСсылка();
	
	НастройкиКД = Элементы.СписокПакетов.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	Для каждого ЭлементКД Из НастройкиКД.Отбор.Элементы Цикл
		
		Если ТипЗнч(ЭлементКД) = Тип("ЭлементОтбораКомпоновкиДанных") И ЭлементКД.Использование Тогда
			Если ЭлементКД.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СпособОбработки") Тогда
				СпособОбработки = ЭлементКД.ПравоеЗначение;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СпособОбработки;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияФормы_ФормаПросмотраСтатистикиОшибок(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("СписокЗначений") И НЕ Результат.Количество() = 0 Тогда
		
		УИДИдентификаторПакетаСписокЗначений.ЗагрузитьЗначения(Результат.ВыгрузитьЗначения());
		УИДИдентификаторПакетаВидСравнения = "ВСписке";
		УИДИдентификаторПакетаИспользование = Истина; 
		
		УИДИдентификаторПакетаПриИзменении(Элементы.УИДИдентификаторПакетаИспользование);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатистикуПакетов_Сервер()
	
	Если ЭтаФорма.Элементы.СтраницыФормы.ТекущаяСтраница = ЭтаФорма.Элементы.СтраницаСтатистика Тогда
		
		СтатистикаПакетов.Очистить();   
		
		// обновим статистику 
		СхемаКомпоновки	 	= РегистрыСведений.ум_ПакетыДанных.ПолучитьМакет("СтатистикаПакетов");
		КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных();
		
		ДанныеРасшифровкиКомпоновкиДанных = Новый ДанныеРасшифровкиКомпоновкиДанных;
		МакетКомпоновки		= КомпоновщикМакета.Выполнить(СхемаКомпоновки,СхемаКомпоновки.ВариантыНастроек["Основной"].Настройки,ДанныеРасшифровкиКомпоновкиДанных,,Тип("ГенераторМакетаКомпоновкиДанных"));
		
		ПроцессорКомпоновки	 = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,ДанныеРасшифровкиКомпоновкиДанных);
		ПроцессорВывода		 = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		
		ПроцессорВывода.УстановитьДокумент(СтатистикаПакетов);
		
		ПроцессорВывода.Вывести(ПроцессорКомпоновки); 
		ДанныеРасшифровкиСКД = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиКомпоновкиДанных,Новый УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСтруктуруВозвратаРасшифровки(ПолеИлиГруппировка,СтруктураПолей)
	
	МассивРодителей = ПолеИлиГруппировка.ПолучитьРодителей();
	Для Каждого Стр из МассивРодителей Цикл
		
		Если ТипЗнч(Стр) = Тип("ЭлементРасшифровкиКомпоновкиДанныхГруппировка") Тогда 
			ПолучитьСтруктуруВозвратаРасшифровки(Стр,СтруктураПолей);
			
		ИначеЕсли ТипЗнч(Стр) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
			ПоляГруппировки = Стр.ПолучитьПоля();
			Для Каждого гСтр из ПоляГруппировки Цикл
				Если СтруктураПолей.Свойство(гСтр.Поле) Тогда
					Если Не ЗначениеЗаполнено(СтруктураПолей[гСтр.Поле]) Тогда
						СтруктураПолей[гСтр.Поле] = гСтр.Значение;
					КонецЕсли;
				КонецЕсли;
				ПолучитьСтруктуруВозвратаРасшифровки(Стр,СтруктураПолей);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеРасшифровки(Расшифровка,СтруктураВозврата)
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровкиСКД);
	ПолучитьСтруктуруВозвратаРасшифровки(Данные.Элементы[Расшифровка],СтруктураВозврата);
	Если ТипЗнч(Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") тогда
		ЭлементРасшифровки = Данные.Элементы[Расшифровка];
		Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
			Для каждого Поле Из ЭлементРасшифровки.ПолучитьПоля() Цикл
				Возврат Поле.Значение;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура СтатистикаПакетовОбработкаРасшифровки_НаСервере(Расшифровка, СсылкаДляОткрытия = Неопределено)
	
	СтруктураВозврата = Новый Структура("СпособОбработки,Статус");
	Данные = ПолучитьДанныеРасшифровки(Расшифровка,СтруктураВозврата);
	
	Если ТипЗнч(Данные) = Тип("СправочникСсылка.ум_СпособыОбработкиПакетов") Тогда
		СсылкаДляОткрытия = Данные;
	Иначе
		СписокПакетов.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(Новый ПользовательскиеНастройкиКомпоновкиДанных);
		
		УстановленОтбор = Ложь;
		
		Если ЗначениеЗаполнено(СтруктураВозврата.СпособОбработки) Тогда
			ОтборПользовательскихНастроек = ум_БСП_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(
										СписокПакетов.КомпоновщикНастроек, 
										Новый ПолеКомпоновкиДанных("СпособОбработки"),
										СтруктураВозврата.СпособОбработки,
										ВидСравненияКомпоновкиДанных.Равно,
										Истина,
										Новый Структура("ВПользовательскиеНастройки, ЗаменятьСуществующий", Истина, Истина,));
			ОтборПользовательскихНастроек.ИдентификаторПользовательскойНастройки = "СпособОбработки";
			УстановленОтбор = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураВозврата.Статус) Тогда
			СоответствиеСостоянияПакетаДанных = Новый Соответствие;
			СоответствиеСостоянияПакетаДанных.Вставить("К обработке"	, ПредопределенноеЗначение("Перечисление.ум_СостоянияПакетаДанных.КОбработке"));
			СоответствиеСостоянияПакетаДанных.Вставить("Отложен"		, ПредопределенноеЗначение("Перечисление.ум_СостоянияПакетаДанных.КОбработке"));
			СоответствиеСостоянияПакетаДанных.Вставить("В обработке"	, ПредопределенноеЗначение("Перечисление.ум_СостоянияПакетаДанных.ВОбработке"));
			СоответствиеСостоянияПакетаДанных.Вставить("Обработан"		, ПредопределенноеЗначение("Перечисление.ум_СостоянияПакетаДанных.Обработан"));
			СоответствиеСостоянияПакетаДанных.Вставить("Ошибка"			, ПредопределенноеЗначение("Перечисление.ум_СостоянияПакетаДанных.Ошибка"));
			
			ОтборПользовательскихНастроек = ум_БСП_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(
										СписокПакетов.КомпоновщикНастроек, 
										Новый ПолеКомпоновкиДанных("Состояние"),
										СоответствиеСостоянияПакетаДанных.Получить(СтруктураВозврата.Статус),
										ВидСравненияКомпоновкиДанных.Равно,
										Истина,
										Новый Структура("ВПользовательскиеНастройки, ЗаменятьСуществующий", Истина, Не УстановленОтбор,));
			ОтборПользовательскихНастроек.ИдентификаторПользовательскойНастройки = "Состояние";
			
			Если СтруктураВозврата.Статус = "Отложен" Тогда
				ОтборПользовательскихНастроек = ум_БСП_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(
										СписокПакетов.КомпоновщикНастроек, 
										Новый ПолеКомпоновкиДанных("СпособОбработки.Активность"),
										Ложь,
										ВидСравненияКомпоновкиДанных.Равно,
										Истина,
										Новый Структура("ВПользовательскиеНастройки, ЗаменятьСуществующий", Истина, Ложь,));
				ОтборПользовательскихНастроек.ИдентификаторПользовательскойНастройки = "Отложен";
			КонецЕсли; 
		КонецЕсли; 
		
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаСписокПакетов;
		ОбновитьСтатистикуПакетов_Сервер();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()

	Если УИДИдентификаторПакетаВидСравнения = "Равно" или УИДИдентификаторПакетаВидСравнения = "НеРавно" Тогда
		Элементы.УИДИдентификаторПакетаЗначение.Видимость = Истина;
		Элементы.УИДИдентификаторПакетаСписокЗначений.Видимость = Ложь;
	Иначе
		Элементы.УИДИдентификаторПакетаЗначение.Видимость = Ложь;
		Элементы.УИДИдентификаторПакетаСписокЗначений.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЭлементОтбораДинамическогоСписка(Знач ИмяПоля, Знач Значение, Знач ВидСравненияОтбора, Знач Использование)
	Перем УИДЗначение;
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Если Не ЗначениеЗаполнено(Значение) Тогда
			УИДЗначение = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
		Иначе
			Попытка
				УИДЗначение = Новый УникальныйИдентификатор(Значение);
			Исключение
				УИДЗначение = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");	
			КонецПопытки;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
		УИДЗначение = Новый СписокЗначений;
		Для каждого текЭлемент из Значение Цикл
			Если Не ЗначениеЗаполнено(текЭлемент.Значение) Тогда
				УИДЗначение.Добавить(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
			Иначе
				Попытка
					УИДЗначение.Добавить(Новый УникальныйИдентификатор(текЭлемент.Значение));
				Исключение
					УИДЗначение.Добавить(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидСравненияОтбора) Тогда
		ТекущийВидСравнения = ВидСравненияОтбора;
	Иначе
		ТекущийВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	ум_БСП_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокПакетов,
		ИмяПоля,
		УИДЗначение,
		ТекущийВидСравнения,
		,
		Использование
	);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНастройкуОтборПоИдентификаторуПакета(Элемент, Настройки, ИспользуютсяСтандартныеНастройки)
	
	Для Каждого ПользовательскаяНастройка Из Настройки.Элементы Цикл
		Если ТипЗнч(ПользовательскаяНастройка) = Тип("ОтборКомпоновкиДанных") Тогда
			Для Каждого ПользовательскаяНастройкаОтбора Из ПользовательскаяНастройка.Элементы Цикл
			Если ПользовательскаяНастройкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИдентификаторПакета") Тогда
					ПользовательскаяНастройка.Элементы.Удалить(ПользовательскаяНастройкаОтбора);
					Возврат;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//-
&НаСервере
Процедура НайтиПоДаннымНаСервере(ПараметрыПоиска)
	
	//ТаймаутДляПрерывания = ум_РаботаСКонстантами.ЗначениеКонстанты(ПланыВидовХарактеристик.ум_Константы.ПоискВПакетах_ЛимитВремени);
	ТаймаутДляПрерывания 				= ПараметрыПоиска.ТаймаутДляПрерывания;
	ИскомаяСтрока	     				= ПараметрыПоиска.ИскомаяСтрока;
	КоличествоВыводимыхПакетовИзВыборки = ПараметрыПоиска.КоличествоВыводимыхПакетовИзВыборки;
	
	
	Если ИскомаяСтрока = "" ИЛИ ИскомаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Т00 = ТекущаяДатаСеанса();
	
	ТЗ = ПреобразованиеДинамическогоСпискаВТаблицуЗначений(ПараметрыПоиска);
	
	Т0 = ТекущаяДатаСеанса();
	Т1 = ТекущаяДатаСеанса();
	
	РезультатСписокЗначений = Новый СписокЗначений;
	
	Итер = 0;
	
	Для каждого Строка Из ТЗ Цикл
		
		Итер = Итер + 1;
		ТЗДанных = Строка.Данные.Получить(); 
		
		Попытка 
			СтрокуВнутр = ЗначениеВСтрокуВнутр(ТЗДанных);
			Если СтрНайти(СтрокуВнутр, ИскомаяСтрока) Тогда
				РезультатСписокЗначений.Добавить(Строка.ИдентификаторПакета);
				КоличествоВыводимыхПакетовИзВыборки = КоличествоВыводимыхПакетовИзВыборки -1;
			КонецЕсли;
		Исключение
		КонецПопытки;
	
		Т1 = ТекущаяДатаСеанса();
		Если (Т1-Т0) > ТаймаутДляПрерывания Тогда
			ум_БСП_ОбщегоНазначения.СообщитьПользователю("Прервано по таймауту");
			Прервать;
		КонецЕсли;
		
		Если КоличествоВыводимыхПакетовИзВыборки < 1 Тогда
			Прервать;
		КонецЕсли;
		
	Конеццикла;
	
	ОтборПользовательскихНастроек = ум_БСП_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(
									СписокПакетов.КомпоновщикНастроек, 
									Новый ПолеКомпоновкиДанных("ИдентификаторПакета"),
									РезультатСписокЗначений,
									ВидСравненияКомпоновкиДанных.ВСписке,
									Истина,
									Новый Структура("ВПользовательскиеНастройки, ЗаменятьСуществующий", Истина, Истина,));
	ОтборПользовательскихНастроек.ИдентификаторПользовательскойНастройки = "Идентификатор пакета";
	
	ТекстСообщения = СтрШаблон("Обработано: %1/%2 пакетов. Отобрано: %3 за %4 сек (Предобработка: %5 сек)"
								, Итер
								, ТЗ.Количество()
								, РезультатСписокЗначений.Количество()
								, (Т1-Т0)
								, (Т0-Т00));
	ум_БСП_ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

//-
&НаСервере
Функция ПреобразованиеДинамическогоСпискаВТаблицуЗначений(ПараметрыПоиска)
	
	// Получаем СКД (текст запроса):
	СКД = Элементы.СписокПакетов.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	
	//ЛимитВыборки = ум_РаботаСКонстантами.ЗначениеКонстанты(ПланыВидовХарактеристик.ум_Константы.ПоискВПакетах_ЛимитВыборки);
	ЛимитВыборки = ПараметрыПоиска.ЛимитВыборки;
	
	СКД.НаборыДанных.НаборДанныхДинамическогоСписка.Запрос = "ВЫБРАТЬ ПЕРВЫЕ " + Формат(ЛимитВыборки, "ЧГ=") + " * ИЗ
	| РегистрСведений.ум_ПакетыДанных КАК РегистрСведенийум_ПакетыДанных 
	| ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ум_ПакетыДанныхДанные КАК РегистрСведенийум_ПакетыДанныхДанные 
	| ПО РегистрСведенийум_ПакетыДанных.ИдентификаторПакета = РегистрСведенийум_ПакетыДанныхДанные.ИдентификаторПакета"; 
	
	// Получаем настройки пользователя (отборы, сортировки и т.п.):
	НастройкиКД = Элементы.СписокПакетов.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	НовоеПоле = НастройкиКД.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("Данные");
	
	// Выводим динамический список в таблицу значений:
	КомпоновщикКД = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКД = КомпоновщикКД.Выполнить(СКД, НастройкиКД, , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	// Инициализируем объект:
	ПроцессорКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКД.Инициализировать(МакетКД);
	
	// Выводим результат в объект:
	ПроцессорВыводаКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	РезультатКД_ТЗ = ПроцессорВыводаКД.Вывести(ПроцессорКД);
	
	//Возвращаем полученную таблицу значений:
	Возврат РезультатКД_ТЗ;
	
КонецФункции

//-
&НаКлиенте
Процедура ПослеЗакрытияФормы(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		НайтиПоДаннымНаСервере(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПакетаВХранилище(ИдентификаторПакета, ИдентификаторФормы = Неопределено) Экспорт
	Данные = ум_ПакетыДанныхОбщегоНазначения.ПолучитьДанныеПакета(ИдентификаторПакета);
	АдресХранилища = ПоместитьВоВременноеХранилище(Данные, ИдентификаторФормы);
	Возврат АдресХранилища;
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();
	
	// 1. Ошибка
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СписокПакетов.Состояние");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ум_СостоянияПакетаДанных.Ошибка;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ТусклоРозовый);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокПакетов");
	
	// 2. Обработан
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СписокПакетов.Состояние");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ум_СостоянияПакетаДанных.Обработан;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(200, 251, 200));
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокПакетов");
	
	// 3. В обработке
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СписокПакетов.Состояние");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ум_СостоянияПакетаДанных.ВОбработке;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Желтый);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокПакетов");
	
	// 4. К обработке
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СписокПакетов.КОбработке");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ум_СостоянияПакетаДанных.ВОбработке;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СписокПакетов.КоличествоПопытокОбработки");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЦианСветлый);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокПакетов");
	
КонецПроцедуры

#КонецОбласти
